tutorials/WSI_tut/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/constant/waveProperties.input";

application     interWaveFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         #calc "$Tw*20";

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.089;

purgeWrite      60;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.1;

libs
(
   //"libwaves.so"
   "libwaves2Foam.so"
);

functions
{

    //#includeFunc       probes
    // #includeFunc       singleGraph
	//#includeIfPresent "../waveGaugesNProbes/surfaceElevation_controlDict";
   
    surfaces
    {
        type            surfaces;
        libs            ("libsampling.so");

        writeControl    adjustableRunTime;
        writeInterval   0.089;

        startTime       8.9;

        surfaceFormat   raw;
        fields          (p_rgh);

        interpolationScheme cellPoint;

        surfaces
        (
            interface
            {
                type            isoSurface;
                isoField        alpha.water;
                isoValue        0.5;
                interpolate     true;
            }
        );
    }	

    surfaceElevation
    {
        type               surfaceElevation;

        functionObjectLibs ( "libwaves2FoamSampling.so" );
        writeControl      timeStep; // Alternative: outputTime
        writeInterval      1;

        //Additional output controls in waves2Foam
        samplingStartTime  -1;
        surfaceSampleDeltaT 0.005;

        setFormat          raw;
        interpolationScheme cellPointFace;
        fields (alpha.water);

        #includeIfPresent "../waveGaugesNProbes/surfaceElevation_sets";

    }
	
}


// ************************************************************************* //
