tutorials/WSI_tut/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

#include        "$FOAM_CASE/constant/waveProperties.input";
Nx              #calc "$Lx*100";

vertices
(
    (0 0.229 0)
    ($Lx 0.229 0)
    ($Lx 0.271 0)
    (0 0.271 0)

    (0 0.229 0.55)
    ($Lx 0.229 0.55)
    ($Lx 0.271 0.55)
    (0 0.271 0.55)

    (0 0.229 0.59)
    ($Lx 0.229 0.59)
    ($Lx 0.271 0.59)
    (0 0.271 0.59)

    (0 0.229 0.6)
    ($Lx 0.229 0.6)
    ($Lx 0.271 0.6)
    (0 0.271 0.6)

    (0 0.229 0.61)
    ($Lx 0.229 0.61)
    ($Lx 0.271 0.61)
    (0 0.271 0.61)

    (0 0.229 0.65)
    ($Lx 0.229 0.65)
    ($Lx 0.271 0.65)
    (0 0.271 0.65)

    (0 0.229 1.2)
    ($Lx 0.229 1.2)
    ($Lx 0.271 1.2)
    (0 0.271 1.2)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nx 6 50) simpleGrading (1 1 0.125)
    hex (4 5 6 7 8 9 10 11) ($Nx 6 20) simpleGrading (1 1 0.4)
	hex (8 9 10 11 12 13 14 15) ($Nx 6 10) simpleGrading (1 1 1)
	hex (12 13 14 15 16 17 18 19) ($Nx 6 10) simpleGrading (1 1 1)	
    hex (16 17 18 19 20 21 22 23) ($Nx 6 20) simpleGrading (1 1 2.5)
    hex (20 21 22 23 24 25 26 27) ($Nx 6 50) simpleGrading (1 1 8)
);

edges
(
);

boundary
(
    ATMOSPHERE
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }

    INLET
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)
            (12 15 19 16)
            (16 19 23 20)
            (20 23 27 24)
        );
    }

    OUTLET
    {
        type patch;
        faces
        (

            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }

    BOTTOM
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    WALL_L
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)			
        );
    }

    WALL_R
    {
        type symmetryPlane;
        faces
        (
			
            (3 2 6 7)
            (7 6 10 11)
            (11 10 14 15)
            (15 14 18 19)
            (19 18 22 23)
            (23 22 26 27)
        );
    }	

);

mergePatchPairs
(
);

// ************************************************************************* //
