tutorials/WSI_tut/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevation
{
    type waveGauge;

    pointDistribution userDefinedDistribution;
    N 8;
    xValues nonuniform List<scalar> 8(0.5 6.3 6.5 7 8 8.5 8.8 14.5);
    yValues uniform 0.25;
    zValues uniform 0.0;
    add       (0 0 0.75);
    axis      z;

    // REQURIED ONLY FOR NEW FUNCTIONOBJECT IMPLEMENTATION
    writeControl adjustableRunTime;
    writeInterval 0.005;
}


// ************************************************************************* //
