tutorials/WSI_tut/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Lw              1.25;
Hw              0.07;
Tw              0.89;
Lx              #calc "12*$Lw";
L1              #calc "3*$Lw";
L2              #calc "$Lx - $L1";

P1              #calc "0.5*$Lx - 0.5";
P2              #calc "0.5*$Lx + 0.5";
P3              #calc "0.5*$Lx + 1";
P4              #calc "$Lx - 0.5";

UxMean          0;

seaLevel        0.6;

seaLevelAsReference  false;

initializationName   INLET;

relaxationNames      (INLET OUTLET);

INLETCoeffs
{
    waveType    stokesFifth;  
    depth       0.6;
    phi         0.0;
    period      $Tw;
    stokesDrift 0.0;
    //specifyPeriod true;
    //specifyEuler  false;
    //stokesVelocity 0;
    //N           32;
    //Niter       8;
    waveNumber  (1 0 0 );
    direction   (1 0 0);
    height      $Hw;
    Tsoft       0;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
	relaxationWeight Exponential;
	exponent         4.5;
        beachType   Empty;

        relaxType   INLET;
        startX      (0 0.227 0);
        endX        ($L1 0.291 1.2);
        orientation (1 0 0);
    }
}

OUTLETCoeffs
{
    waveType    potentialCurrent;  
    U           ($UxMean 0 0);
    Tsoft       2;
  
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape Rectangular;
	relaxationWeight Exponential;
	exponent         4.5;
        beachType   Empty;

        relaxType   OUTLET;
        startX      ($L2 0.227 0);
        endX        ($Lx 0.291 1.2);
        orientation (1 0 0);
    }
}




// ************************************************************************* //
