tutorials/WSI_tut/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/constant/waveProperties";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($UxMean 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    INLET
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    OUTLET
    {
        type            fixedValue;
        value           $internalField;
    }

    WALL_R
    {
        type            symmetryPlane;
    }
	WALL_L
    {
        type            symmetryPlane;
    }
	
    BOTTOM
    {
        type            noSlip;
    }

    ATMOSPHERE
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity $internalField;
        value           uniform (0 0 0);
    }

    FB
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
