tutorials/WSI_tut/0/p_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    INLET
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    OUTLET
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    WALL_R
    {
        type            symmetryPlane;
    }
    WALL_L
    {
        type            symmetryPlane;
    }
	
    BOTTOM
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
	
    ATMOSPHERE
    {
        type            totalPressure;
        p0              uniform 0;
    }

    FB 
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}

// ************************************************************************* //
