tutorials/WSI_tut/0/omega.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    INLET
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }

    BOTTOM
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    ATMOSPHERE
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    WALL_R
    {
        type            symmetryPlane;
    }
	WALL_L
    {
        type            symmetryPlane;
    }

    FB 
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}



// ************************************************************************* //
