tutorials/WSI_tut/0/pointDisplacement.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    OUTLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    WALL_R
    {
        type            symmetryPlane;
    }
	WALL_L
    {
        type            symmetryPlane;
    }
	
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ATMOSPHERE
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    FB
    {
        type            calculated;
    }
}


// ************************************************************************* //
