tutorials/WSI_tut/system/changeDictionaryDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    ATMOSPHERE
    {
        type            patch;

    }
}

U
{
boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
}
}

alpha.water
{
boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
}
}

// ************************************************************************* //
