tutorials/WSI_tut/system/changeDictionaryDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


U
{
boundaryField
{
    INLET
    {
        type            waveVelocity;
    }
}
}

alpha.water
{
boundaryField
{
    INLET
    {
        type            waveAlpha;
    }
}
}

// ************************************************************************* //
