tutorials/WSI_tut/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (alpha.water p_rgh);
probeLocations
(
    (1	0.55	0)
    (1	0.55251	0)
    (1	0.55495	0)
    (1	0.55732	0)
    (1	0.55961	0)
    (1	0.56185	0)
    (1	0.56401	0)
    (1	0.56611	0)
    (1	0.56815	0)
    (1	0.57013	0)
    (1	0.57205	0)
    (1	0.57391	0)
    (1	0.57572	0)
    (1	0.57747	0)
    (1	0.57916	0)
    (1	0.5808	0)
    (1	0.5824	0)
    (1	0.58394	0)
    (1	0.58543	0)
    (1	0.58688	0)
    (1	0.58828	0)
    (1	0.58964	0)
    (1	0.59095	0)
    (1	0.59222	0)
    (1	0.59345	0)
    (1	0.59464	0)
    (1	0.59578	0)
    (1	0.59689	0)
    (1	0.59796	0)
    (1	0.599	0)
    (1	0.6	0)
    (1	0.601	0)
    (1	0.60204	0)
    (1	0.60311	0)
    (1	0.60422	0)
    (1	0.60537	0)
    (1	0.60655	0)
    (1	0.60778	0)
    (1	0.60905	0)
    (1	0.61036	0)
    (1	0.61172	0)
    (1	0.61312	0)
    (1	0.61457	0)
    (1	0.61606	0)
    (1	0.6176	0)
    (1	0.6192	0)
    (1	0.62084	0)
    (1	0.62253	0)
    (1	0.62428	0)
    (1	0.62609	0)
    (1	0.62795	0)
    (1	0.62987	0)
    (1	0.63185	0)
    (1	0.63389	0)
    (1	0.63599	0)
    (1	0.63815	0)
    (1	0.64039	0)
    (1	0.64268	0)
    (1	0.64505	0)
    (1	0.64749	0)
    (1	0.65	0)
    (3	0.55	0)
    (3	0.55251	0)
    (3	0.55495	0)
    (3	0.55732	0)
    (3	0.55961	0)
    (3	0.56185	0)
    (3	0.56401	0)
    (3	0.56611	0)
    (3	0.56815	0)
    (3	0.57013	0)
    (3	0.57205	0)
    (3	0.57391	0)
    (3	0.57572	0)
    (3	0.57747	0)
    (3	0.57916	0)
    (3	0.5808	0)
    (3	0.5824	0)
    (3	0.58394	0)
    (3	0.58543	0)
    (3	0.58688	0)
    (3	0.58828	0)
    (3	0.58964	0)
    (3	0.59095	0)
    (3	0.59222	0)
    (3	0.59345	0)
    (3	0.59464	0)
    (3	0.59578	0)
    (3	0.59689	0)
    (3	0.59796	0)
    (3	0.599	0)
    (3	0.6	0)
    (3	0.601	0)
    (3	0.60204	0)
    (3	0.60311	0)
    (3	0.60422	0)
    (3	0.60537	0)
    (3	0.60655	0)
    (3	0.60778	0)
...
    (11	0.65	0)

);

// ************************************************************************* //
