tutorials/WSI_tut/system/refineMeshDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c1;

coordinateSystem global;

globalCoeffs
{
    tan1            (1 0 0);
    tan2            (0 1 0);
    tan3            (0 0 1);
}

patchLocalCoeffs
{
    patch           outside;
    tan1            (1 0 0);
    tan2            (0 1 0);
    tan3            (0 0 1);
}

directions      ( 
                  //tan1 
                  tan2 
                  //normal 
                );

useHexTopology  yes;

geometricCut    yes;

writeMesh       no;


// ************************************************************************* //
